# Reverse Polish Notation Calculator

Perform mathematical operations in Ruby.

Run the calculator with the following command:
```ruby rpn.rb```

Enter ```c``` to clear the stack.

Enter ```q``` to exit the program.

## Operators

The RPN Calculator supports the following operators:

```+``` ```-``` ```/``` ```*``` ```**```

## Example Input/Output

``` 
> 8
8.0
> 9
9.0
> +
17.0
```

```
> 18
18.0
> 2
2.0
> *
36.0
> 5
5.0
> -
31.0
```